# Project 1: Deaths by tuberculosis 

## North Africa (2016)

### (Mohamed Adjal)

In [1]:
import warnings
warnings.simplefilter('ignore', FutureWarning)

In [2]:
from pandas import *
data = read_excel('TB_North_Africa_2016.xls')
data

      Country  Total population  TB deaths
0     Algeria          40606052       3100
1       Egypt          95688681        290
2       Libya           6293253        610
3  Mauritania           4301018        890
4     Morocco          35276786       3300
5     Tunisia          11403248        370

In [3]:
tbCol = data['TB deaths']

The total number of deaths in 2016 is:

In [4]:
tbCol.sum()

8560

The largest and smallest number of deaths in a single country are:

In [5]:
tbCol.max()

3300

In [6]:
tbCol.min()

290

The average number of deaths, over all countries in the data.

In [7]:
tbCol.mean()

1426.6666666666667

In [8]:
tbCol.median()

750.0

The mean is almost double than the median. This indicates that some of the countries had a very high number of TB deaths in 2016.

# The most affected

In [9]:
data.sort_values('TB deaths')

      Country  Total population  TB deaths
1       Egypt          95688681        290
5     Tunisia          11403248        370
2       Libya           6293253        610
3  Mauritania           4301018        890
0     Algeria          40606052       3100
4     Morocco          35276786       3300

In [10]:
popCol = data['Total population']
data['TB deaths (total)'] = tbCol * 100 / popCol
data

      Country  Total population  TB deaths  TB deaths (total)
0     Algeria          40606052       3100           0.007634
1       Egypt          95688681        290           0.000303
2       Libya           6293253        610           0.009693
3  Mauritania           4301018        890           0.020693
4     Morocco          35276786       3300           0.009355
5     Tunisia          11403248        370           0.003245